//
//  File.swift
//  singleview
//
//  Created by Park Jung Gyu on 25/10/2015.
//  Copyright © 2015 pyfamily. All rights reserved.
//

func getHanjaFromHangul(hangul: String) -> [String]{
    
    let ll = hanjaData[hangul]
    
    var p: [String] = [String]()
    
    for e in ll! {
        p.append(e.0)
    }
    
    return p
}


let hanjaData = [
"병":[("丙","셋째천간 병",5),
("病","병 병",10),
("兵","군사 병",7),
("竝","나란히 병",10),
("並","나란히 병",8),
("屛","병풍 병",11),
("幷","아우를 병",8),
("并","아우를 병",6),
("倂","아우를 병",10),
("甁","병 병",13),
("輧","수레 병",15),
("炳","빛날 병",9),
("柄","자루 병",9),
("棅","자루 병",12),
("昞","밝을 병",9),
("昺","밝을 병",9),
("秉","잡을 병",8),
("餠","떡 병",17),
("騈","나란히 병",18),
("鉼","판금 병",16),
("抦","잡을 병",9),
],
"년":[("年","해 년",6),
("秊","해 년",8),
("撚","비틀 년",16),
],
"최":[("最","가장 최",12),
("催","재촉할 최",13),
("崔","높을 최",11),
],
"녀":[("女","계집 녀",3),
],
"별":[("別","다를 별",7),
("瞥","언뜻볼 별",17),
("鼈","자라 별",25),
("鱉","자라 별",23),
("襒","털 별",17),
("莂","모종낼 별",13),
("鷩","금계 별",23),
("NA","짙지않은향기 별",17),
("NA","클 별",12),
],
"변":[("變","변할 변",23),
("辨","분별할 변",16),
("辯","말잘할 변",21),
("邊","가 변",22),
("卞","법제 변",4),
("弁","고깔 변",5),
("便","곧 변",9),
("釆","분별할 변",7),
],
]

